content/emacs/configs/programming/README.org
#+TITLE: Programming Configuration Modules
#+AUTHOR: Kyeong Soo Choi
#+DATE: 2025-11-19

* Overview

This directory contains programming language-specific configuration modules, organized by language and functionality.

* Module Structure

** File Organization

| File           | Description                                                  | Tangles To           | Lines |
|----------------+--------------------------------------------------------------+----------------------+-------|
| =00-loader.org=  | Main loader, orchestrates all programming configs            | =prog-conf.el=         | ~47   |
| =01-general.org= | Common programming tools (completion, version control, etc.) | =prog-general-conf.el= | ~225  |
| =02-web.org=     | Web development (HTML/CSS/JS/TS/frameworks)                  | =prog-web-conf.el=     | ~455  |
| =03-python.org=  | Python development environment                               | =prog-python-conf.el=  | ~191  |
| =04-ruby.org=    | Ruby and Rails development                                   | =prog-ruby-conf.el=    | ~341  |

** Load Order

The loader (=00-loader.org=) loads modules in this order:

1. =prog-general-conf= → Common tools
2. =prog-web-conf= → Web development
3. =prog-python-conf= → Python
4. =prog-ruby-conf= → Ruby

Platform-specific tools (Clojure, SQL, tree-sitter) are loaded conditionally by the loader.

* What Each Module Provides

** 00-loader.org (Configuration Loader)

*** Core Responsibilities
- Loads all language-specific modules
- Manages platform-specific tools
- Provides Clojure (CIDER) support
- SQL database integration (ejc-sql)
- Tree-sitter parser infrastructure

*** Platform-Specific Features
Only loaded on non-Windows systems:
- CIDER (Clojure development)
- ejc-sql (SQL database client)
- tree-sitter (fast parsing library)

** 01-general.org (Common Programming Tools)

*** Categories
- *Completion*: corfu, corfu-candidate-overlay
- *Compilation*: Enhanced compile mode with ANSI colors
- *Version Control*: magit, project management, smerge
- *Documentation*: eldoc, eldoc-box
- *Syntax Checking*: flymake with multiple backends
- *Code Formatting*: format-all, apheleia
- *Editing*: electric-pair, rainbow-delimiters, code folding
- *Build Tools*: makefile-mode, compilation shortcuts

*** Key Features
- Universal completion interface
- Git integration with magit
- Project-based workflow
- Inline documentation
- Automatic code formatting

** 02-web.org (Web Development)

*** Languages & Frameworks
- HTML (with smart mode selection)
- CSS, SCSS, SASS, Less
- JavaScript (ES6+, JSX)
- TypeScript (TS, TSX)
- Vue, React, Angular, Svelte
- Template engines (Nunjucks, Handlebars)

*** Tools
- *web-mode*: Unified editor for web templates
- *emmet-mode*: HTML/CSS abbreviation expansion
- *prettier-js*: Code formatter
- *eslint*: JavaScript linter
- *lsp-mode*: Language Server Protocol
- *typescript-mode*: TypeScript support

*** Smart Features
- Auto mode selection based on file size
- Syntax-aware indentation
- Tag manipulation (tagedit)
- Live preview capabilities

** 03-python.org (Python Development)

*** Core Features
- python-mode with tree-sitter
- Virtual environment management (pyvenv)
- Code formatting (black, isort)
- Testing (pytest integration)
- Enhanced REPL (inferior-python)

*** Development Tools
- LSP support (pyright/pylsp)
- Import sorting
- Docstring helpers
- Debug integration

*** Workflow
- Automatic venv detection
- Format on save
- Test runner shortcuts
- REPL integration

** 04-ruby.org (Ruby Development)

*** Ruby Language Support
- Enhanced ruby-mode
- Interactive REPL (inf-ruby)
- RuboCop integration
- Bundler support

### Ruby on Rails
- Rails-specific commands
- Generator integration
- Migration helpers
- Controller/View navigation

*** Testing
- RSpec mode
- Minitest support
- Test runner integration

* Adding New Languages

To add support for a new language:

** 1. Create Module File

Create =0X-language.org= in this directory:

#+begin_src org
,* Language Name Configuration

Configuration for Language Name development.

,** Overview
...

,#+begin_src emacs-lisp :tangle ~/.emacs.d/elisp/settings/prog-language-conf.el
  ;;; prog-language-conf.el --- Language configuration -*- lexical-binding: t; -*-
  ;;; Commentary:
  ;;; Code:

  ;; Your configuration here

  (provide 'prog-language-conf)
  ;;; prog-language-conf.el ends here
,#+end_src
#+end_src

** 2. Update Loader

Add to =00-loader.org=:

#+begin_src emacs-lisp
  ;; Load language-specific configurations
  ...
  (require 'prog-language-conf)  ; Add this line
#+end_src

** 3. Update Parent Index

Add to =../09-programming.org=:

#+begin_src org
,** Language Name Development
,#+INCLUDE: "programming/0X-language.org" :minlevel 2
#+end_src

** 4. Update This README

Add entry to the module table and description section.

* Tangling

** Tangle All Programming Configs

From repository root:

#+begin_src sh
  # Tangle just programming configs
  emacs --batch --eval "(progn
    (require 'org)
    (mapc 'org-babel-tangle-file
      (directory-files \"content/configs/programming\" t \"\\\\.org$\")))"
#+end_src

Or use the global tangle script:

#+begin_src sh
  ./tangle.sh
#+end_src

** Tangle Individual Module

Open the module file and run:
- =M-x org-babel-tangle=
- Or: =C-c C-v t=

* HTML Export

The parent file =../09-programming.org= uses =#+INCLUDE= to combine all modules for export.

From repository root:
#+begin_src sh
  ./build.sh
#+end_src

* File Sizes

Current module sizes:

#+begin_src sh
  wc -l programming/*.org
#+end_src

| Module | Lines |
|--------|-------|
| 00-loader | ~50 |
| 01-general | ~250 |
| 02-web | ~480 |
| 03-python | ~220 |
| 04-ruby | ~370 |

* Benefits of This Structure

✅ **Language Isolation** - Each language in its own file
✅ **Easy to Navigate** - Find Python config quickly
✅ **Selective Loading** - Can disable languages by commenting out =require=
✅ **Maintainable** - Changes to web config don't affect Python
✅ **Extensible** - Add new languages easily
✅ **Documented** - Each module has detailed explanations
